app/Controllers/Auth.php

    public function processLogin()
    {
        $session = session();
        $model = new UserModel();

        $login = $this->request->getPost('login');
        $password = $this->request->getPost('password');

        // Mencari user berdasarkan email atau username
        $user = $model->where('email', $login)
                      ->orWhere('username', $login)
                      ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'penjual22222'
OR `username` = 'penjual22222'
 LIMIT 1

    public function googleCallback()
    {
        $client = new \Google\Client();
        $client->setClientId('625128778616-3p6jkrmd8sjq3i5kjs74qcqvd3ti4715.apps.googleusercontent.com');
        $client->setClientSecret('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');
        $client->setRedirectUri('http://localhost:8080/auth/googleCallback');

        $code = $this->request->getVar('code');
        if (!$code) return redirect()->to('/login')->with('error', 'Code tidak ditemukan');

        $token = $client->fetchAccessTokenWithAuthCode($code);
        if (isset($token['error'])) return redirect()->to('/login')->with('error', 'Login Google gagal');

        $client->setAccessToken($token['access_token']);
        $google = new Oauth2($client);
        $data = $google->userinfo->get();

        $model = new UserModel();
        $user = $model->where('email', $data->email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'okansw576@gmail.com'
 LIMIT 1