app/Controllers/Pesanan.php

INSERT INTO `pesanan` (`id_tempat`, `nama_tempat`, `kategori`, `nama_pemesan`, `nomor_hp`, `menu_pesanan`, `jumlah`, `harga_perkiraan`, `catatan`, `metode_pembayaran`, `status_pesanan`, `tanggal_pesan`, `user_id`) VALUES ('6', 'Cafe Kopi Aja', 'Cafe', 'Salma Okan', '08123456789', '[{\"name\":\"Kopi Latte\",\"quantity\":2,\"price\":28000,\"subtotal\":56000},{\"name\":\"Chicken Sandwich\",\"quantity\":1,\"price\":45000,\"subtotal\":45000}]', 3, 113120, 'tanpa nasi', 'Tunai', 'Menunggu Konfirmasi', '2026-05-05 07:18:10', NULL)
---

        try {
            // Insert data ke database
            $pesanan_id = $model->insert($data);